app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
---
  def index
    @tasks = Task.all;

SELECT  "tasks".* FROM "tasks" WHERE (3) LIMIT $1  [["LIMIT", 1]]
---
    task = Task.find( params[:id] )