app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all.order(:id)
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."id" ASC

  def show
    task_id = params[:id].to_i
    @task = Task.find_by(id: task_id)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def create
    new_task = Task.new(task_params)

    is_successful = new_task.save
---
INSERT INTO "tasks" ("task", "created_at", "updated_at", "descriptions") VALUES ($1, $2, $3, $4) RETURNING "id"  [["task", "I have to do stuff"], ["created_at", "2019-04-30 23:01:11.456325"], ["updated_at", "2019-04-30 23:01:11.456325"], ["descriptions", ""]]

  def update
    existing_task = Task.find_by(id: params[:id])

    # is_successful = existing_task.update(task_params)

    if existing_task && existing_task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "tasks" SET "task" = $1, "descriptions" = $2, "completion_date" = $3, "updated_at" = $4 WHERE "tasks"."id" = $5  [["task", "Hi Heather"], ["descriptions", "Auditorium"], ["completion_date", "today"], ["updated_at", "2019-04-12 21:22:14.291694"], ["id", 7]]

    task = Task.find_by(id: params[:id])

    task.toggle(:completed)
    task.save
    task.touch
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "tasks" SET "task" = $1, "descriptions" = $2, "completion_date" = $3, "updated_at" = $4 WHERE "tasks"."id" = $5  [["task", "fsefef"], ["descriptions", "sdgsgsg"], ["completion_date", "dsgsdgsd"], ["updated_at", "2019-04-12 20:59:53.595948"], ["id", 7]]
INSERT INTO "tasks" ("task", "created_at", "updated_at", "descriptions", "completion_date") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["task", "I have to...eat"], ["created_at", "2019-04-12 18:43:07.051186"], ["updated_at", "2019-04-12 18:43:07.051186"], ["descriptions", "lunch"], ["completion_date", "incomplete"]]
UPDATE "tasks" SET "completed" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed", true], ["updated_at", "2019-04-30 23:02:43.868000"], ["id", 14]]
UPDATE "tasks" SET "completed" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed", true], ["updated_at", "2019-04-13 01:38:23.432460"], ["id", 4]]

    task = Task.find_by(id: params[:id])

    if task.nil?
        head :not_found
    else
      task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 12]]