app/controllers/tasks_controller.rb

    task = Task.find_by(id: params[:id])

    task.toggle(:completed)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed", true], ["updated_at", "2019-04-13 01:38:23.432460"], ["id", 4]]